app/controllers/specialties_controller.rb

  def index
  	@specialties = Specialty.all
---
SELECT "specialties".* FROM "specialties"

  def create
  @specialty = Specialty.new(specialty_params)

  @specialty.save
---
INSERT INTO "specialties" ("created_at", "title", "updated_at") VALUES (?, ?, ?)  [["created_at", "2015-03-26 04:56:08.315025"], ["title", "cardio"], ["updated_at", "2015-03-26 04:56:08.315025"]]